namespace Frost.Frost_PLD.Frost_PLD_Data
{
    public enum PLDBuffID : uint
    {
        减速 = 9u,
        强化药 = 49u,
        雪仇 = 1193u,

        神圣领域 = 82u,
        钢铁信念 = 79u,
        战逃反应 = 76u,
        沥血剑预备 = 3847u,
        安魂祈祷 = 1368u,
        悔罪预备 = 3019u,
        神圣魔法效果提高 = 2673u,
        赎罪剑预备 = 1902u,
        祈告剑预备 = 3827u,
        葬送剑预备 = 3828u,
        荣耀之剑预备 = 3831u,




        战技封印1 = 6u,
        战技封印2 = 620u,

        能力封印1 = 5u,
        能力封印2 = 634u,
        能力封印3 = 1092u,

    }

}
