namespace Frost.Frost_WAR.Frost_WAR_Data
{
    public enum WARBuffID : uint
    {
        减速 = 9u,
        强化药 = 49u,
        狂暴 = 86u,
        战栗 = 87u,
        死斗 = 409u,
        复仇 = 89u,
        守护 = 91u,
        /// <summary>
        /// 减轻所受到的伤害
        /// </summary>
        铜墙铁盾 = 194u,

        /// <summary>
        /// 减轻所受到的伤害
        /// </summary>
        坚守要塞 = 195u,

        /// <summary>
        /// 受到攻击的伤害减少
        /// </summary>
        圣盾之恩 = 655u,

        /// <summary>
        /// 减轻所受到的伤害
        /// </summary>
        原初大地 = 863u,
        原初的解放 = 1177u,
        雪仇 = 1193u,
        /// <summary>
        /// 移动速度提高，不受能通过净化解除的异常状态以及击退、吸引的效果影响，并且蛮荒崩裂与混沌旋风的威力提高
        /// </summary>
        原初的解放1 = 1303u,

        /// <summary>
        /// 无法自由移动，受到伤害也不会解除
        /// 另外，除特定攻击之外其他所有对自身发动的攻击均无法令体力减少到1以下
        /// </summary>
        死斗1 = 1304u,

        /// <summary>
        /// 无法自由移动，受到伤害也不会解除
        /// </summary>
        死斗2 = 1305u,

        /// <summary>
        /// 抵消一定伤害
        /// </summary>
        摆脱1 = 1457u,

        /// <summary>
        /// 自身发动战技命中时可以恢复体力
        /// </summary>
        原初的勇猛1 = 1857u,

        /// <summary>
        /// 附加此效果的战士受到原初的勇猛的恢复体力的效果时，会获得相当于其100%的恢复效果
        /// 另外受到攻击的伤害减少
        /// </summary>
        原初的武猛1 = 1858u,

        /// <summary>
        /// 兽魂足够时，地毁人亡变为混沌旋风
        /// 习得狂魂后，裂石飞环变为狂魂
        /// </summary>
        原初的混沌 = 1897u,

        /// <summary>
        /// 受到攻击的伤害增加
        /// </summary>
        全力挥打 = 1977u,

        /// <summary>
        /// 受到攻击的伤害减少
        /// </summary>
        铁壁1 = 1978u,
        铁壁0 = 71u,
        铁壁 = 1191u,
        铁壁2 = 4168u,

        /// <summary>
        /// 可以发动混沌旋风
        /// </summary>
        原初的混沌2 = 1992u,

        /// <summary>
        /// 抵消一定伤害
        /// </summary>
        摆脱2 = 1993u,

        /// <summary>
        /// 自身的物理攻击命中时会吸收体力
        /// 另外受到攻击的伤害减少
        /// </summary>
        原初的勇猛2 = 2061u,

        /// <summary>
        /// 对自身附加此效果的战士因原初的勇猛吸收到体力时，自身也会一起恢复相同量的体力
        /// 另外受到攻击的伤害减少
        /// </summary>
        原初的武猛2 = 2062u,

        /// <summary>
        /// 受到攻击的伤害增加
        /// </summary>
        狂魂 = 2077u,

        /// <summary>
        /// 受到攻击的伤害增加
        /// </summary>
        混沌旋风 = 2078u,

        /// <summary>
        /// 攻击所造成的伤害降低
        /// </summary>
        雪仇剑 = 2101u,

        /// <summary>
        /// 体力会随时间逐渐恢复
        /// </summary>
        持续摆脱 = 2108u,

        /// <summary>
        /// 受到攻击时会对攻击者造成反击伤害
        /// </summary>
        还击 = 2184u,

        /// <summary>
        /// 自身的物理攻击命中时会吸收体力
        /// </summary>
        原初的勇猛3 = 2227u,

        白牛清汁 = 2619u,
        /// <summary>
        /// 可以发动蛮荒崩裂
        /// </summary>
        蛮荒崩裂预备 = 2624u,
        原初的觉悟 = 2663u,
        /// <summary>
        /// 攻击所造成的伤害提高
        /// </summary>
        战场风暴 = 2677u,

        /// <summary>
        /// 自身发动战技命中时可以恢复体力，同时减轻所受到的伤害
        /// </summary>
        原初的血气1 = 2678u,

        /// <summary>
        /// 减轻所受到的伤害
        /// </summary>
        原初的血潮 = 2679u,

        /// <summary>
        /// 抵消一定伤害
        /// </summary>
        原初的血烟1 = 2680u,

        /// <summary>
        /// 体力会随时间逐渐恢复
        /// </summary>
        泰然自若 = 2681u,

        水流幕1 = 2708u,
        生命回生法 = 2710u,
        擢升 = 2717u,
        /// <summary>
        /// 减轻所受到的伤害
        /// </summary>
        战争神之盾 = 2831u,

        /// <summary>
        /// 受到攻击的伤害增加
        /// </summary>
        猛攻 = 3029u,

        /// <summary>
        /// 发动战技攻击时附带吸收体力的效果
        /// </summary>
        原初的血气2 = 3030u,

        /// <summary>
        /// 抵消一定伤害
        /// </summary>
        原初的血烟2 = 3031u,

        /// <summary>
        /// プライマルレンドを実行できる状態。
        /// </summary>
        プライマルレンド実行可 = 3032u,

        水流幕2 = 3086u,
        /// <summary>
        /// 体力最大值提高
        /// </summary>
        战栗1 = 3185u,

        /// <summary>
        /// 攻击所造成的伤害降低
        /// </summary>
        群山隆起 = 3256u,

        /// <summary>
        /// 受到攻击的伤害减少并且受到物理攻击时会发动反击
        /// 同时，受到伤害或持续时间结束后，为自身附加持续恢复体力的效果
        /// </summary>
        戮罪 = 3832u,

        /// <summary>
        /// 身体里积蓄着原初的搏动，积蓄3档后该状态变为原初的怒震预备
        /// </summary>
        原初的搏动 = 3833u,

        /// <summary>
        /// 可以发动尽毁
        /// </summary>
        尽毁预备 = 3834u,

        /// <summary>
        /// 体力会随时间逐渐恢复
        /// </summary>
        讨罪 = 3900u,

        /// <summary>
        /// 可以发动原初的怒震
        /// </summary>
        原初的怒震预备 = 3901u,


        战技封印1 = 6u,
        战技封印2 = 620u,

        能力封印1 = 5u,
        能力封印2 = 634u,
        能力封印3 = 1092u,

    }

}
